AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
    OtaUpdateSerializers(smWideOr8ch, ModParams->PayloadLength);
    // OtaUpdateSerializers(newSwitchMode, ModParams->PayloadLength);
    // MspSender.setMaxPackageIndex(ELRS_MSP_MAX_PACKAGES);
    // TelemetryReceiver.setMaxPackageIndex(OtaIsFullRes ? ELRS8_TELEMETRY_MAX_PACKAGES : ELRS4_TELEMETRY_MAX_PACKAGES);

    ExpressLRS_currAirRate_Modparams = ModParams;
    ExpressLRS_currAirRate_RFperfParams = RFperf;
    // CRSF::LinkStatistics.rf_Mode = ModParams->enum_rate;

    // handset->setPacketInterval(interval * ExpressLRS_currAirRate_Modparams->numOfSends);
    // connectionState = disconnected;
    // rfModeLastChangedMS = millis();
}

void ICACHE_RAM_ATTR HandleFHSS() // ELRS移植，注释源码另起修改
{
  uint8_t modresult = (OtaNonce + 1) % ExpressLRS_currAirRate_Modparams->FHSShopInterval;
  // If the next packet should be on the next FHSS frequency, do the hop
  if (!InBindingMode && modresult == 0)
  {
    // // Gemini mode
    // // If using DualBand always set the correct frequency band to the radios.  The HighFreq/LowFreq Tx amp is set during config.
    // if ((isDualRadio() && config.GetAntennaMode() == TX_RADIO_MODE_GEMINI) || FHSSuseDualBand)
    // {
    //     // Optimises the SPI traffic order.
    //     if (Radio.GetProcessingPacketRadio() == SX12XX_Radio_1)
    //     {
    //         uint32_t freqRadio = FHSSgetNextFreq();
    //         Radio.SetFrequencyReg(FHSSgetGeminiFreq(), SX12XX_Radio_2);
    //         Radio.SetFrequencyReg(freqRadio, SX12XX_Radio_1);
    //     }
    //     else
    //     {
    //         Radio.SetFrequencyReg(FHSSgetNextFreq(), SX12XX_Radio_1);
    //         Radio.SetFrequencyReg(FHSSgetGeminiFreq(), SX12XX_Radio_2);
    //     }
    // }
    // else
    // if(waitforTimSyncount == 0)
    {
      Radio.SetFrequencyReg(FHSSgetNextFreq());
    }
  }
}

void ICACHE_RAM_ATTR SendRCdataToRF() // ELRS移植，注释源码另起修改
{
  // // Do not send a stale channels packet to the RX if one has not been received from the handset
  // // *Do* send data if a packet has never been received from handset and the timer is running
  // // this is the case when bench testing and TXing without a handset
  // bool dontSendChannelData = false;
  // uint32_t lastRcData = handset->GetRCdataLastRecv();
  // if (lastRcData && (micros() - lastRcData > 1000000))
  // {
  //   // The tx is in Mavlink mode and without a valid crsf or RC input.  Do not send stale or fake zero packet RC!
  //   // Only send sync and MSP packets.
  //   if (config.GetLinkMode() == TX_MAVLINK_MODE)
  //   {
  //     dontSendChannelData = true;
  //   }
  //   else
  //   {
  //     return;
  //   }
  // }

//   busyTransmitting = true;

  uint32_t const now = millis();
  // ESP requires word aligned buffer
  WORD_ALIGNED_ATTR OTA_Packet_s otaPkt = {0};
//   static uint8_t syncSlot;
//
//   const bool isTlmDisarmed = config.GetTlm() == TLM_RATIO_DISARMED;
//   uint32_t SyncInterval = (connectionState == connected && !isTlmDisarmed) ? ExpressLRS_currAirRate_RFperfParams->SyncPktIntervalConnected : ExpressLRS_currAirRate_RFperfParams->SyncPktIntervalDisconnected;
//   bool skipSync = InBindingMode ||
//     // TLM_RATIO_DISARMED keeps sending sync packets even when armed until the RX stops sending telemetry and the TLM=Off has taken effect
//     (isTlmDisarmed && handset->IsArmed() && (ExpressLRS_currTlmDenom == 1));
//
  uint8_t NonceFHSSresult = OtaNonce % ExpressLRS_currAirRate_Modparams->FHSShopInterval;

  if(apInputBuffer.size())
  {
    OtaPackAirportData(&otaPkt, &apInputBuffer);
  }
  // Sync spam only happens on slot 1 and 2 and can't be disabled
  else if (/*(syncSpamCounter || (syncSpamCounterAfterRateChange &&*/!InBindingMode && FHSSonSyncChannel()/* && (NonceFHSSresult == 1 || NonceFHSSresult == 2)*/)
  {
    otaPkt.std.type = PACKET_TYPE_SYNC;
    GenerateSyncPacketData(OtaIsFullRes ? &otaPkt.full.sync.sync : &otaPkt.std.sync);
    // syncSlot = 0; // reset the sync slot in case the new rate (after the syncspam) has a lower FHSShopInterval
  }
  // Regular sync rotates through 4x slots, twice on each slot, and telemetry pushes it to the next slot up
  // But only on the sync FHSS channel and with a timed delay between them
//   else if ((!skipSync) && ((syncSlot / 2) <= NonceFHSSresult) && (now - SyncPacketLastSent > SyncInterval) && FHSSonSyncChannel())
//   {
//     otaPkt.std.type = PACKET_TYPE_SYNC;
//     GenerateSyncPacketData(OtaIsFullRes ? &otaPkt.full.sync.sync : &otaPkt.std.sync);
//     syncSlot = (syncSlot + 1) % (ExpressLRS_currAirRate_Modparams->FHSShopInterval * 2);
//   }
  else
  {
    // if ((NextPacketIsMspData && MspSender.IsActive())/* || dontSendChannelData*/)
    {
      otaPkt.std.type = PACKET_TYPE_MSPDATA;
      if (OtaIsFullRes)
      {
        // otaPkt.full.msp_ul.packageIndex = MspSender.GetCurrentPayload(
        //   otaPkt.full.msp_ul.payload,
        //   sizeof(otaPkt.full.msp_ul.payload));
        // if (config.GetLinkMode() == TX_MAVLINK_MODE)
        //   otaPkt.full.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      }
      else
      {
        otaPkt.std.msp_ul.packageIndex = 1;
        if (InBindingMode)
        {
          memcpy(&otaPkt.std.msp_ul.payload[0], MSPDataPackage, 5);
        }
        else
        {
          memcpy(&otaPkt.std.msp_ul.payload[0], "HELLO", 5);
        }
        // otaPkt.std.msp_ul.packageIndex = MspSender.GetCurrentPayload(
        //   otaPkt.std.msp_ul.payload,
        //   sizeof(otaPkt.std.msp_ul.payload));
        // if (config.GetLinkMode() == TX_MAVLINK_MODE)
        //   otaPkt.std.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      }

      // // send channel data next so the channel messages also get sent during msp transmissions
      // NextPacketIsMspData = false;
      // counter can be increased even for normal msp messages since it's reset if a real bind message should be sent
      BindingSendCount++;
      // // If the telemetry ratio isn't already 1:2, send a sync packet to boost it
      // // to add bandwidth for the reply
      // if (ExpressLRS_currTlmDenom != 2)
      //   syncSpamCounter = 1;
    }
    // else
    // {
      // // always enable msp after a channel package since the slot is only used if MspSender has data to send
      // NextPacketIsMspData = true;

